---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceServerExtensions.Dispose
source: html/1981b5c8-a547-634a-db29-70cd74f0aa81.htm
---
# Autodesk.Revit.DB.ExternalResourceServerExtensions.Dispose Method

Releases all resources used by the ExternalResourceServerExtensions

## Syntax (C#)
```csharp
public void Dispose()
```